GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
		sprintf(buf,"AT%%ETCPIP=1,\"%s\",\"%s\"\r\n",jt808_param.user,jt808_param.psw);
		rt_kprintf( "gsm_send>%s", buf );
		m66_write( &dev_gsm, 0, buf, strlen( buf ) );
		timer_set( &timer_gsm_tcpip, RT_TICK_PER_SECOND * 30 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( pt_resp_STR_OK ) ) );
		if( timer_expired( &timer_gsm_tcpip ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			PT_EXIT(pt);
		}

		sprintf(buf,"AT%%ETCPIP?\r\n");
		rt_kprintf( "gsm_send>%s", buf );
		m66_write( &dev_gsm, 0, buf, strlen( buf ) );
		timer_set( &timer_gsm_tcpip, RT_TICK_PER_SECOND * 30 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( pt_resp_ETCPIP ) ) );
		if( timer_expired( &timer_gsm_tcpip ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			PT_EXIT(pt);
		}

		sprintf(buf,"AT%%IOMODE=1,2,1\r\n");
		rt_kprintf( "gsm_send>%s", buf );
		m66_write( &dev_gsm, 0, buf, strlen( buf ) );
		timer_set( &timer_gsm_tcpip, RT_TICK_PER_SECOND * 30 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( pt_resp_STR_OK ) ) );
		if( timer_expired( &timer_gsm_tcpip ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			PT_EXIT(pt);
		}
		socket_state=SOCKET_READY;
	}
	PT_END( pt );
}






ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;


/***********************************************************
* Function:       rt_thread_entry_gsm
* Description:    接收处理，状态转换
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	ch;

	PT_INIT( &pt_gsm_power );
	PT_INIT( &pt_gsm_tcpip );
	PT_INIT( &pt_gsm_socket );
	
	while( 1 )
	{
		protothread_gsm_power( &pt_gsm_power );
		protothread_gsm_tcpip( &pt_gsm_tcpip );
		protothread_gsm_tcpip( &pt_gsm_socket );
/*接收超时判断*/

		while( rt_ringbuffer_getchar( &rb_uart4_rx, &ch ) == 1 ) /*有数据时，保存数据*/
		{
			gsm_rx[gsm_rx_wr++] = ch;
			if( gsm_rx_wr == GSM_RX_SIZE )
			{
				gsm_rx_wr = 0;
			}
			gsm_rx[gsm_rx_wr] = 0;
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 10 )  //等待100ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( gsm_rx, gsm_rx_wr );                      /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_thread_t tid;

/*初始化串口接收缓冲区*/
	rt_ringbuffer_init( &rb_uart4_rx, uart4_rxbuf, UART4_RX_SIZE );

	rt_mb_init( &mb_gsmrx, "gsm_rx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= m66_init;
	dev_gsm.open	= m66_open;
	dev_gsm.close	= m66_close;
	dev_gsm.read	= m66_read;
	dev_gsm.write	= m66_write;
	dev_gsm.control = m66_control;

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}

#ifdef TEST_GSM


/*控制gsm状态 0 查询*/
rt_err_t gsmstate( int cmd )
{
	if(cmd==0)
	{
		rt_kprintf("gsm_state=%d\r\n",gsm_state);
	}
	else
	{
		gsm_state=cmd;
	}	
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( gsmstate, control gsm state );


/*控制socket状态 0 查询*/
rt_err_t socketstate( int cmd )
{
	if(cmd==0)
	{
		rt_kprintf("socket_state=%d\r\n",socket_state);
	}
	else
	{
		socket_state=cmd;
	}	
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( socketstate, control socket state );


/*apn信息设置*/
rt_err_t apn_config(char *apn,char *user, char *psw)
{
	strcpy(jt808_param.apn,apn);
	strcpy(jt808_param.user,user);
	strcpy(jt808_param.psw,psw);
	return RT_EOK;
}
FINSH_FUNCTION_EXPORT( apn_config, config apn);

/*sock信息设置*/
rt_err_t sock_config(uint8_t linkno,char *doamin,uint16_t port)
{
	strcpy(gsm_socket[linkno].domain_name,doamin);
	gsm_socket[linkno].port=port;
	return RT_EOK;
}
FINSH_FUNCTION_EXPORT( sock_config, config sock);



/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t gsm_write( char *sinfo )
{
	return m66_write( &dev_gsm, 0, sinfo, strlen( sinfo ) );
}

FINSH_FUNCTION_EXPORT( gsm_write, write gsm );

#if 0

/*设置链接的socket参数*/
rt_err_t sock_config( uint8_t linkno, char* apn, char *connect_str )
{
	if( linkno >= GSM_MAX_SOCK_NUM )
	{
		return RT_ERROR;
	}
	if( gsm_socket[linkno].active != 0 )
	{
		return RT_ERROR;
	}
	gsm_socket[linkno].active = 0;
	strcpy( gsm_socket[linkno].apn, apn );
	strcpy( gsm_socket[linkno].conn_str, connect_str );
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( sock_config, < linkno > < apn > < connstr > );

/*控制socket链接*/
rt_err_t sock_control( uint8_t linkno, uint8_t action )
{
	if( linkno >= GSM_MAX_SOCK_NUM )
	{
		return RT_ERROR;
	}
	if( gsm_socket[linkno].active ^ action ) /*有状态变化*/
	{
		rt_kprintf( "sock>%d\n", __LINE__ );
		if( action == 1 )
		{
			if( tid_gsm_subthread == RT_NULL )
			{
				tid_gsm_subthread = rt_thread_create( "ppp", gsm_socket_open, (void*)&linkno, 512, 25, 5 );
				if( tid_gsm_subthread != RT_NULL )
				{
					tid_gsm_subthread->cleanup = cleanup;
					rt_thread_startup( tid_gsm_subthread );
					rt_kprintf( "sock>%d\n", __LINE__ );
					return RT_EOK;
				}
				rt_kprintf( "sock>%d\n", __LINE__ );
				return RT_ERROR;
			}
			rt_kprintf( "sock>%d\n", __LINE__ );
			return RT_ERROR;
		}else
		{
			if( tid_gsm_subthread == RT_NULL )
			{
				tid_gsm_subthread = rt_thread_create( "ppp", gsm_socket_close, (void*)linkno, 512, 25, 5 );
				if( tid_gsm_subthread != RT_NULL )
				{
					rt_thread_startup( tid_gsm_subthread );
					rt_kprintf( "sock>%d\n", __LINE__ );
					return RT_EOK;
				}
				rt_kprintf( "sock>%d\n", __LINE__ );
				return RT_ERROR;
			}
			rt_kprintf( "sock>%d\n", __LINE__ );
			return RT_ERROR;
		}
	}
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( sock_control, < linkno > < 0 | 1 > );

#endif

#endif
#endif

/************************************** The End Of File **************************************/
